[
  {
    "id": "1",
    "name": "Dwarf Warriors",
    "army_id": "2",
    "min_size": "10",
    "max_size": "40",
    "points": "100",
    "description": "A unit of Dwarf Warriors has 10 or more models. Most Dwarf Warriors enter battle armed with either a Dwarf Axe or a Dwarf Hammer, but some units prefer instead to wield Double-handed Dwarf Axes to cut down their foes with mighty swings. Many units also carry sturdy Dwarf Shields.",
    "options": "[{\"name\":\"Veteran\",\"desc\":\"The leader of this unit is the Veteran. A Veteran makes 2 attacks rather than 1.\"},{\"name\":\"Standard Bearers\",\"desc\":\"Models in this unit may be Standard Bearers. Standard Bearers can carry either a Runic Icon or a Clan Banner.\"},{\"name\":\"Hornblowers\",\"desc\":\"Models in this unit can be Hornblowers. When a unit containing any Hornblowers runs, they can ‘Sound the Advance’. If they do so, do not roll a dice to see how far the unit runs; instead, they can move up to an extra 4\\\".\"}]",
    "abilities": "[{\"name\":\"Resolute in Defence\",\"desc\":\"You can re-roll failed wound rolls of 1 when attacking with a Dwarf Warrior in your opponent’s combat phase. You can instead re-roll all failed wound rolls for a Dwarf Warrior if its unit has 20 or more models when it attacks in your opponent’s combat phase.\"},{\"name\":\"Dwarf Shields\",\"desc\":\"A unit equipped with Dwarf Shields can create a shield wall instead of running or charging in its turn. If it does so, re-roll all failed save rolls for the unit in the combat phase until its next movement phase.\"},{\"name\":\"Runic Icon\",\"desc\":\"Roll a dice if a spell affects a unit with any Runic Icons. On a roll of a 5 or a 6, that spell has no affect on the unit (but it will affect other units normally).\"},{\"name\":\"Clan Banner\",\"desc\":\"If you fail a battleshock test for a unit that has any Clan Banners, halve the number of models that flee (rounding up).\"}]",
    "command_abilities": null,
    "notes": null,
    "created_at": "2017-01-22 12:13:13",
    "updated_at": "2017-01-22 12:13:13"
  }
]
